Revit 2027 API
TriangulatedShellComponent.IsClosed Property
 True if and only if the triangulation represents a topologically closed shell (i.e., each edge is shared by two triangles).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsClosed { get; }
Public ReadOnly Property IsClosed As Boolean
	Get
public:
property bool IsClosed {
	bool get ();
}
member IsClosed : bool with get
Property Value
Boolean
See Also
Reference
TriangulatedShellComponent Class
Autodesk.Revit.DB Namespace